const WEATHER_DESCRIPTIONS = [
  {
    code: 1000,
    icon: 113,
    day: 'Солнечно',
  },
  {
    code: 1003,
    icon: 116,
    day: 'Переменная облачность',
  },
  {
    code: 1006,
    icon: 119,
    day: 'Облачно',
  },
  {
    code: 1009,
    icon: 122,
    day: 'Пасмурно',
  },
  {
    code: 1030,
    icon: 143,
    day: 'Дымка',
  },
  {
    code: 1063,
    icon: 176,
    day: 'Местами дождь',
  },
  {
    code: 1066,
    icon: 179,
    day: 'Местами снег',
  },
  {
    code: 1069,
    icon: 182,
    day: 'Местами дождь со снегом',
  },
  {
    code: 1072,
    icon: 185,
    day: 'Местами замерзающая морось',
  },
  {
    code: 1087,
    icon: 200,
    day: 'Местами грозы',
  },
  {
    code: 1114,
    icon: 227,
    day: 'Поземок',
  },
  {
    code: 1117,
    icon: 230,
    day: 'Метель',
  },
  {
    code: 1135,
    icon: 248,
    day: 'Туман',
  },
  {
    code: 1147,
    icon: 260,
    day: 'Переохлажденный туман',
  },
  {
    code: 1150,
    icon: 263,
    day: 'Местами слабая морось',
  },
  {
    code: 1153,
    icon: 266,
    day: 'Слабая морось',
  },
  {
    code: 1168,
    icon: 281,
    day: 'Замерзающая морось',
  },
  {
    code: 1171,
    icon: 284,
    day: 'Сильная замерзающая морось',
  },
  {
    code: 1180,
    icon: 293,
    day: 'Местами небольшой дождь',
  },
  {
    code: 1183,
    icon: 296,
    day: 'Небольшой дождь',
  },
  {
    code: 1186,
    icon: 299,
    day: 'Временами умеренный дождь',
  },
  {
    code: 1189,
    icon: 302,
    day: 'Умеренный дождь',
  },
  {
    code: 1192,
    icon: 305,
    day: 'Временами сильный дождь',
  },
  {
    code: 1195,
    icon: 308,
    day: 'Сильный дождь',
  },
  {
    code: 1198,
    icon: 311,
    day: 'Слабый переохлажденный дождь',
  },
  {
    code: 1201,
    icon: 314,
    day: 'Умеренный или сильный переохлажденный дождь',
  },
  {
    code: 1204,
    icon: 317,
    day: 'Небольшой дождь со снегом',
  },
  {
    code: 1207,
    icon: 320,
    day: 'Умеренный или сильный дождь со снегом',
  },
  {
    code: 1210,
    icon: 323,
    day: 'Местами небольшой снег',
  },
  {
    code: 1213,
    icon: 326,
    day: 'Небольшой снег',
  },
  {
    code: 1216,
    icon: 329,
    day: 'Местами умеренный снег',
  },
  {
    code: 1219,
    icon: 332,
    day: 'Умеренный снег',
  },
  {
    code: 1222,
    icon: 335,
    day: 'Местами сильный снег',
  },
  {
    code: 1225,
    icon: 338,
    day: 'Сильный снег',
  },
  {
    code: 1237,
    icon: 350,
    day: 'Ледяной дождь',
  },
  {
    code: 1240,
    icon: 353,
    day: 'Небольшой ливневый дождь',
  },
  {
    code: 1243,
    icon: 356,
    day: 'Умеренный или сильный ливневый дождь',
  },
  {
    code: 1246,
    icon: 359,
    day: 'Сильные ливни',
  },
  {
    code: 1249,
    icon: 362,
    day: 'Небольшой ливневый дождь со снегом',
  },
  {
    code: 1252,
    icon: 365,
    day: 'Умеренные или сильные ливневые дожди со снегом',
  },
  {
    code: 1255,
    icon: 368,
    day: 'Небольшой снег',
  },
  {
    code: 1258,
    icon: 371,
    day: 'Умеренный или сильный снег',
  },
  {
    code: 1261,
    icon: 374,
    day: 'Небольшой ледяной дождь',
  },
  {
    code: 1264,
    icon: 377,
    day: 'Умеренный или сильный ледяной дождь',
  },
  {
    code: 1273,
    icon: 386,
    day: 'В отдельных районах местами небольшой дождь с грозой',
  },
  {
    code: 1276,
    icon: 389,
    day: 'В отдельных районах умеренный или сильный дождь с грозой',
  },
  {
    code: 1279,
    icon: 392,
    day: 'В отдельных районах местами небольшой снег с грозой',
  },
  {
    code: 1282,
    icon: 395,
    day: 'В отдельных районах умеренный или сильный снег с грозой',
  },
];

export default WEATHER_DESCRIPTIONS;
